This is a generated file for the l3build validation system.
Don't change this file in any respect.
============================================================
TEST 1: no .gnuplot
============================================================
runsystem(gnuplot gh1397.normal.gnuplot)...executed.
-------- gh1397.normal.gnuplot (start) ---------
(gh1397.normal.gnuplot) set table "gh1397.normal.table"; set format "%.5f"[nl]
set samples 25; plot [x=-2:2] x**2[nl]
-------- gh1397.normal.gnuplot (end) -----------
============================================================
============================================================
TEST 2: no .gnuplot, leading space in function
============================================================
runsystem(gnuplot gh1397.leading-space.gnuplot)...executed.
-------- gh1397.leading-space.gnuplot (start) ---------
(gh1397.leading-space.gnuplot) set table "gh1397.leading-space.table"; set format "%.5f"[nl]
set samples 25; plot [x=-2:2] x**2[nl]
-------- gh1397.leading-space.gnuplot (end) -----------
============================================================
============================================================
TEST 3: no .gnuplot, trailing space in function
============================================================
runsystem(gnuplot gh1397.trailing-space.gnuplot)...executed.
-------- gh1397.trailing-space.gnuplot (start) ---------
(gh1397.trailing-space.gnuplot) set table "gh1397.trailing-space.table"; set format "%.5f"[nl]
set samples 25; plot [x=-2:2] x**2[nl]
-------- gh1397.trailing-space.gnuplot (end) -----------
============================================================
============================================================
TEST 4: .gnuplot existing and matched
============================================================
============================================================
============================================================
TEST 5: .gnuplot existing but outdated
============================================================
runsystem(gnuplot gh1397.normal.gnuplot)...executed.
-------- gh1397.normal.gnuplot (start) ---------
(gh1397.normal.gnuplot) set table "gh1397.normal.table"; set format "%.5f"[nl]
set samples 25; plot [x=-4:4] x**2[nl]
-------- gh1397.normal.gnuplot (end) -----------
============================================================
